#### Terraform Plan (staging) 📖`success`

<details><summary>Show Plan (staging)</summary>

```

terraform
[0m[1mdata.terraform_remote_state.foundation: Reading...[0m[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_iam_policy.eks_s3_access: Refreshing state... [id=arn:aws:iam::677282655012:policy/astro-data-pipeline-staging-eks-s3-access][0m
[0m[1maws_iam_role.eks_cluster: Refreshing state... [id=astro-data-pipeline-staging-eks-cluster-role][0m
[0m[1maws_iam_role.eks_nodes: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role][0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=677282655012][0m
[0m[1maws_cloudwatch_log_group.eks_cluster: Refreshing state... [id=/aws/eks/astro-data-pipeline-staging-eks/cluster][0m
[0m[1mdata.terraform_remote_state.foundation: Read complete after 0s[0m
[0m[1maws_iam_role_policy_attachment.eks_cni_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716922200000003][0m
[0m[1maws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716971600000006][0m
[0m[1maws_iam_role_policy_attachment.eks_container_registry_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716915000000002][0m
[0m[1maws_iam_role_policy_attachment.eks_s3_access: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716894500000001][0m
[0m[1maws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-cluster-role-20251003214716933600000004][0m
[0m[1maws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=astro-data-pipeline-staging-eks-cluster-role-20251003214716938200000005][0m
[0m[1maws_eks_cluster.main: Refreshing state... [id=astro-data-pipeline-staging-eks][0m
[0m[1maws_eks_addon.kube_proxy: Refreshing state... [id=astro-data-pipeline-staging-eks:kube-proxy][0m
[0m[1maws_eks_addon.vpc_cni: Refreshing state... [id=astro-data-pipeline-staging-eks:vpc-cni][0m
[0m[1maws_eks_node_group.main["general"]: Refreshing state... [id=astro-data-pipeline-staging-eks:astro-data-pipeline-staging-general][0m
[0m[1maws_eks_addon.coredns: Refreshing state... [id=astro-data-pipeline-staging-eks:coredns][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_addon_version.coredns[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "coredns" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.30"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.kube_proxy[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "kube_proxy" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.30"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.vpc_cni[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "vpc_cni" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.30"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # aws_eks_addon.coredns[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_addon" "coredns" {
      [33m~[0m[0m addon_version               = "v1.11.4-eksbuild.24" -> (known after apply)
        id                          = "astro-data-pipeline-staging-eks:coredns"
        tags                        = {}
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eks_addon.kube_proxy[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_addon" "kube_proxy" {
      [33m~[0m[0m addon_version               = "v1.29.15-eksbuild.16" -> (known after apply)
        id                          = "astro-data-pipeline-staging-eks:kube-proxy"
        tags                        = {}
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eks_addon.vpc_cni[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_addon" "vpc_cni" {
      [33m~[0m[0m addon_version               = "v1.20.3-eksbuild.1" -> (known after apply)
        id                          = "astro-data-pipeline-staging-eks:vpc-cni"
        tags                        = {}
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eks_cluster.main[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_cluster" "main" {
        id                            = "astro-data-pipeline-staging-eks"
        name                          = "astro-data-pipeline-staging-eks"
        tags                          = {
            "Name" = "astro-data-pipeline-staging-eks-cluster"
        }
      [33m~[0m[0m version                       = "1.29" [33m->[0m[0m "1.30"
        [90m# (11 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 4 to change, 0 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m eks_cluster_platform_version           = "eks.56" [33m->[0m[0m "eks.50"
  [33m~[0m[0m eks_cluster_version                    = "1.29" [33m->[0m[0m "1.30"
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "rds_multi_az" but a
[33m│[0m [0mvalue was found in file "../staging.tfvars". If you meant to use this
[33m│[0m [0mvalue, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "airflow_namespace" but a
[33m│[0m [0mvalue was found in file "../staging.tfvars". If you meant to use this
[33m│[0m [0mvalue, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValues for undeclared variables[0m
[33m│[0m [0m
[33m│[0m [0m[0mIn addition to the other similar warnings shown, 25 other variable(s)
[33m│[0m [0mdefined without being declared.
[33m╵[0m[0m

```

</details>

*Pushed by: @p27mcgee, Action: `pull_request`*